Repository: capape/getsupernovae
Catalog: locales/*/LC_MESSAGES/getsupernovae.po
Languages: ca

source: Created PDF: {name}
ca: PDF creat: {name}

source: No selection
ca: Sense selecció

source: No text selected in the Results pane.
ca: No hi ha text seleccionat al panell de Resultats.

source: Already present
ca: Ja és present

source: '{name}' is already ignored.
ca: '{name}' ja està ignorada.

source: Added
ca: Afegida

source: Added '{name}' to ignored supernovae.
ca: '{name}' afegida a supernoves ignorades.

source: Save error
ca: Error en desar

source: Failed to update ignore file: {ex}
ca: Error en actualitzar fitxer d'ignorades: {ex}

source: Edit ignored/old supernovae
ca: Editar supernoves ignorades/antigues

source: Failed to save file: {ex}
ca: Error en desar fitxer: {ex}

source: Save
ca: Desar

source: Close
ca: Tancar

source: Add observing site
ca: Afegir lloc d'observació

source: Latitude (deg):
ca: Latitud (graus):

source: Longitude (deg):
ca: Longitud (graus):

source: Height (m):
ca: Alçada (m):

source: Latitude must be between -90 and 90 degrees
ca: La latitud ha d'estar entre -90 i 90 graus

source: Longitude must be between -180 and 180 degrees
ca: La longitud ha d'estar entre -180 i 180 graus

source: Site name is required
ca: El nom del lloc és obligatori

source: Invalid input: {e}
ca: Entrada invàlida: {e}

source: Overwrite
ca: Sobreescriure

source: Site '{nm}' already exists. Overwrite?
ca: El lloc '{nm}' ja existeix. Sobreescriure?

source: Failed to save site: {e}
ca: Error en desar lloc: {e}

source: Name:
ca: Nom:

source: Min Alt (deg):
ca: Alt mín (graus):

source: Max Alt (deg):
ca: Alt màx (graus):

source: Min Az (deg):
ca: Az mín (graus):

source: Max Az (deg):
ca: Az màx (graus):

source: Name is required
ca: El nom és obligatori

source: Invalid numeric input: {e}
ca: Entrada numèrica invàlida: {e}

source: Window '{nm}' already exists. Overwrite?
ca: La finestra '{nm}' ja existeix. Sobreescriure?

source: Invalid input
ca: Entrada invàlida

source: Name is required.
ca: El nom és obligatori.

source: Numeric fields must be valid numbers.
ca: Els camps numèrics han de ser nombres vàlids.

source: A window with that name already exists.
ca: Ja existeix una finestra amb aquest nom.

source: Failed to add window: {e}
ca: Error en afegir finestra: {e}

source: Delete
ca: Eliminar

source: Failed to delete window: {e}
ca: Error en eliminar finestra: {e}

source: Add
ca: Afegir

source: All fields (name, latitude, longitude, height) are required to add a site.
ca: Tots els camps (nom, latitud, longitud, alçada) són obligatoris per afegir un lloc.

source: Invalid values
ca: Valors invàlids

source: Latitude, longitude and height must be numeric
ca: La latitud, longitud i alçada han de ser numèriques

source: Duplicate site
ca: Lloc duplicat

source: A site named '{existing}' already exists (case-insensitive).
ca: Ja existeix un lloc anomenat '{existing}' (sense distinció de majúscules).

source: Failed to save site: {ex}
ca: Error en desar lloc: {ex}

source: Select a site to delete
ca: Seleccioneu un lloc per eliminar

source: Confirm Delete
ca: Confirmar eliminació

source: Delete site '{nm}'?
ca: Eliminar lloc '{nm}'?

source: Failed to delete site '{nm}'
ca: Error en eliminar lloc '{nm}'

source: Failed to save sites after delete: {e}
ca: Error en desar llocs després d'eliminar: {e}

source: Find latest supernovae
ca: Cercar darreres supernoves

source: Max. magnitude:
ca: Magnitud màx.:

source: Find the n previous days:
ca: Cercar els n dies previs:

source: Observation date:
ca: Data d'observació:

source: Init time in observation date:
ca: Hora d'inici en data d'observació:

source: Hours of observation:
ca: Hores d'observació:

source: Site:
ca: Lloc:

source: Language:
ca: Idioma:

source: Visibility window:
ca: Finestra de visibilitat:

source: Min latitude:
ca: Latitud mín.:

source: Results:
ca: Resultats:

source: Dark mode
ca: Mode fosc

source: Ignore selected SN
ca: Ignorar SN seleccionada

source: Edit Ignored SN
ca: Editar SN ignorades

source: Refresh Search
ca: Actualitzar cerca

source: Exit
ca: Sortir

source: Usage: getsupernovae.py maxMag lastDays
ca: Ús: getsupernovae.py magMàxima diesEnrere

source: RA: {ra}, DECL. {decl}
ca: RA: {ra}, DEC: {decl}

source: Supernovae from: {fromDate} to {to}. Magnitud <= {magnitude}
ca: Supernoves des de: {fromDate} fins {to}. Magnitud <= {magnitude}

source: . Window: minAlt {minAlt:.1f}º maxAlt {maxAlt:.1f}º minAz {minAz:.1f}º maxAz {maxAz:.1f}º
ca: . Finestra: altMín {minAlt:.1f}º altMàx {maxAlt:.1f}º azMín {minAz:.1f}º azMàx {maxAz:.1f}º

source: Window: {rest}
ca: Finestra: {rest}

source: Date: {date}, Mag: {mag}, T: {type}, Name: {name}
ca: Data: {date}, Mag: {mag}, T: {type}, Nom: {name}

source: Const: {const}, Host: {host}
ca: Constel·lació: {const}, Galàxia amfitriona: {host}

source: Visible from : {from_} to: {to}
ca: Visible des de: {from_} fins: {to}

source: AzCoords az: {az}, lat: {lat}
ca: AzCoords az: {az}, alt: {lat}

source: Last azCoords az: {az}, lat: {lat}
ca: Últims AzCoords az: {az}, alt: {lat}

source: Discovered: {first} , MAX Mag: {max} on: {on}
ca: Descoberta: {first} , MÀX Mag: {max} el: {on}

source: Date: {date}, Mag: {mag}, T: {type}, Name:{name} Const: {constellation}, Host:{host} RA:{ra}, DECL.{decl} Visible from :{visible_from} to: {visible_to} AzCoords az:{az0}, lat: {alt0} Last azCoords az:{az1}, lat: {alt1} Discovered: {firstObserved}, MAX Mag: {maxMagnitude} on: {maxMagnitudeDate} {link}
ca: Data: {date}, Mag: {mag}, T: {type}, Nom: {name} Constel·lació: {constellation}, Galàxia amfitriona: {host} RA: {ra}, DEC: {decl} Visible des de: {visible_from} fins: {visible_to} AzCoords az: {az0}, alt: {alt0} Últims AzCoords az: {az1}, alt: {alt1} Descoberta: {firstObserved}, MÀX Mag: {maxMagnitude} el: {maxMagnitudeDate} {link}

source: Site: lon: {lon:.2f} lat: {lat:.2f} height: {height:.2f}m . Min alt {minAlt}º
ca: Lloc: lon: {lon:.2f} lat: {lat:.2f} alçada: {height:.2f}m . Alt mín {minAlt}º

source: Const: {const} - {host} S: {name}, M: {mag}, T: {type}
ca: Constel·lació: {const} - {host} S: {name}, M: {mag}, T: {type}

source: Visible from : {from_} to: {to} az: {az}, LAT: {lat}
ca: Visible des de: {from_} fins: {to} az: {az}, ALT: {lat}
