Repository: capape/getsupernovae
Catalog: python/getsupernovae/locales/*/LC_MESSAGES/getsupernovae.po
Languages: es

source: Created PDF: {name}
es: PDF creado: {name}

source: No selection
es: Sin selección

source: No text selected in the Results pane.
es: No hay texto seleccionado en el panel de Resultados.

source: Already present
es: Ya está presente

source: '{name}' is already ignored.
es: '{name}' ya está ignorada.

source: Added
es: Añadida

source: Added '{name}' to ignored supernovae.
es: '{name}' añadida a supernovas ignoradas.

source: Save error
es: Error al guardar

source: Failed to update ignore file: {ex}
es: Error al actualizar archivo de ignorados: {ex}

source: Edit ignored/old supernovae
es: Editar supernovas ignoradas/antiguas

source: Failed to save file: {ex}
es: Error al guardar archivo: {ex}

source: Save
es: Guardar

source: Close
es: Cerrar

source: Add observing site
es: Añadir sitio de observación

source: Latitude (deg):
es: Latitud (grados):

source: Longitude (deg):
es: Longitud (grados):

source: Height (m):
es: Altura (m):

source: Latitude must be between -90 and 90 degrees
es: La latitud debe estar entre -90 y 90 grados

source: Longitude must be between -180 and 180 degrees
es: La longitud debe estar entre -180 y 180 grados

source: Site name is required
es: El nombre del sitio es obligatorio

source: Invalid input: {e}
es: Entrada inválida: {e}

source: Overwrite
es: Sobrescribir

source: Site '{nm}' already exists. Overwrite?
es: El sitio '{nm}' ya existe. ¿Sobrescribir?

source: Failed to save site: {e}
es: Error al guardar sitio: {e}

source: Name:
es: Nombre:

source: Min Alt (deg):
es: Alt mín (grados):

source: Max Alt (deg):
es: Alt máx (grados):

source: Min Az (deg):
es: Az mín (grados):

source: Max Az (deg):
es: Az máx (grados):

source: Name is required
es: El nombre es obligatorio

source: Invalid numeric input: {e}
es: Entrada numérica inválida: {e}

source: Window '{nm}' already exists. Overwrite?
es: La ventana '{nm}' ya existe. ¿Sobrescribir?

source: Invalid input
es: Entrada inválida

source: Name is required.
es: El nombre es obligatorio.

source: Numeric fields must be valid numbers.
es: Los campos numéricos deben ser números válidos.

source: A window with that name already exists.
es: Ya existe una ventana con ese nombre.

source: Failed to add window: {e}
es: Error al añadir ventana: {e}

source: Delete
es: Eliminar

source: Failed to delete window: {e}
es: Error al eliminar ventana: {e}

source: Add
es: Añadir

source: All fields (name, latitude, longitude, height) are required to add a site.
es: Todos los campos (nombre, latitud, longitud, altura) son obligatorios para añadir un sitio.

source: Invalid values
es: Valores inválidos

source: Latitude, longitude and height must be numeric
es: La latitud, longitud y altura deben ser numéricas

source: Duplicate site
es: Sitio duplicado

source: A site named '{existing}' already exists (case-insensitive).
es: Ya existe un sitio llamado '{existing}' (sin distinción de mayúsculas).

source: Failed to save site: {ex}
es: Error al guardar sitio: {ex}

source: Select a site to delete
es: Seleccione un sitio para eliminar

source: Confirm Delete
es: Confirmar eliminación

source: Delete site '{nm}'?
es: ¿Eliminar sitio '{nm}'?

source: Failed to delete site '{nm}'
es: Error al eliminar sitio '{nm}'

source: Failed to save sites after delete: {e}
es: Error al guardar sitios después de eliminar: {e}

source: Find latest supernovae
es: Buscar últimas supernovas

source: Max. magnitude:
es: Magnitud máx.:

source: Find the n previous days:
es: Buscar los n días previos:

source: Observation date:
es: Fecha de observación:

source: Init time in observation date:
es: Hora de inicio en fecha de observación:

source: Hours of observation:
es: Horas de observación:

source: Site:
es: Sitio

source: Language:
es: Idioma

source: Visibility window:
es: Ventana de visibilidad

source: Min latitude:
es: Latitud mín.:

source: Results:
es: Resultados

source: Dark mode
es: Modo oscuro

source: Ignore selected SN
es: Ignorar SN seleccionada

source: Edit Ignored SN
es: Editar SN ignoradas

source: Refresh Search
es: Actualizar búsqueda

source: Exit
es: Salir

source: Usage: getsupernovae.py maxMag lastDays
es: Uso: getsupernovae.py magMáxima díasAtrás

source: Date: {date}, Mag: {mag}, T: {type}, Name:{name} Const: {constellation}, Host:{host} RA:{ra}, DECL.{decl} Visible from :{visible_from} to: {visible_to} AzCoords az:{az0}, lat: {alt0} Last azCoords az:{az1}, lat: {alt1} Discovered: {firstObserved}, MAX Mag: {maxMagnitude} on: {maxMagnitudeDate} {link}
es: Fecha: {date}, Mag: {mag}, T: {type}, Nombre: {name} Constelación: {constellation}, Galaxia anfitriona: {host} RA: {ra}, DEC: {decl} Visible desde: {visible_from} hasta: {visible_to} AzCoords az: {az0}, alt: {alt0} Últimos AzCoords az: {az1}, alt: {alt1} Descubierta: {firstObserved}, MÁX Mag: {maxMagnitude} el: {maxMagnitudeDate} {link}

source: Site: lon: {lon:.2f} lat: {lat:.2f} height: {height:.2f}m . Min alt {minAlt}º
es: Sitio: lon: {lon:.2f} lat: {lat:.2f} altura: {height:.2f}m . Alt mín {minAlt}º

source: Supernovae from: {fromDate} to {to}. Magnitud <= {magnitude}
es: Supernovas desde: {fromDate} hasta {to}. Magnitud <= {magnitude}

source: Date: {date}, Mag: {mag}, T: {type}, Name: {name}
es: Fecha: {date}, Mag: {mag}, T: {type}, Nombre: {name}

source: Const: {const}, Host: {host}
es: Constelación: {const}, Galaxia anfitriona: {host}

source: RA: {ra}, DECL. {decl}
es: RA: {ra}, DEC: {decl}

source: Visible from : {from_} to: {to}
es: Visible desde: {from_} hasta: {to}

source: AzCoords az: {az}, lat: {lat}
es: AzCoords az: {az}, alt: {lat}

source: Last azCoords az: {az}, lat: {lat}
es: Últimos AzCoords az: {az}, alt: {lat}

source: Discovered: {first} , MAX Mag: {max} on: {on}
es: Descubierta: {first} , MÁX Mag: {max} el: {on}

source: Const: {const} - {host} S: {name}, M: {mag}, T: {type}
es: Constelación: {const} - {host} S: {name}, M: {mag}, T: {type}

source: D: {date} RA: {ra}, DEC: {dec}
es: F: {date} RA: {ra}, DEC: {dec}

source: Visible from : {from_} to: {to} az: {az}, LAT: {lat}
es: Visible desde: {from_} hasta: {to} az: {az}, ALT: {lat}

source: Site: lon: {lon:.2f} lat: {lat:.2f} height: {height:.2f}m . Window: minAlt {minAlt:.1f}º maxAlt {maxAlt:.1f}º minAz {minAz:.1f}º maxAz {maxAz:.1f}º
es: Sitio: lon: {lon:.2f} lat: {lat:.2f} altura: {height:.2f}m . Ventana: altMín {minAlt:.1f}º altMáx {maxAlt:.1f}º azMín {minAz:.1f}º azMáx {maxAz:.1f}º

source: . Window: minAlt {minAlt:.1f}º maxAlt {maxAlt:.1f}º minAz {minAz:.1f}º maxAz {maxAz:.1f}º
es: . Ventana: altMín {minAlt:.1f}º altMáx {maxAlt:.1f}º azMín {minAz:.1f}º azMáx {maxAz:.1f}º

source: Window: {rest}
es: Ventana: {rest}
